; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	thermograph0 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	Star0 - direction
	Star1 - direction
	Star4 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument6 infrared1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star1)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument8 thermograph2)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star0)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet5)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star1)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(have_image Planet5 infrared1)
	(have_image Planet6 thermograph2)
	(have_image Planet7 thermograph0)
	(have_image Phenomenon8 thermograph2)
	(have_image Planet9 infrared1)
	(have_image Phenomenon10 infrared1)
))

)

; plan
1. (turn_to satellite4 star1 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 star1)
   goals met: 0 of 7
2. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 0 of 7
3. (calibrate satellite4 instrument9 star1)
   added: (calibrated instrument9)
   goals met: 0 of 7
4. (turn_to satellite4 planet5 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 planet5)
   goals met: 0 of 7
5. (take_image satellite4 planet5 instrument9 infrared1)
   added: (have_image planet5 infrared1)
   goals met: 1 of 7
6. (turn_to satellite4 phenomenon8 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 phenomenon8)
   goals met: 1 of 7
7. (take_image satellite4 phenomenon8 instrument9 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 2 of 7
8. (turn_to satellite4 phenomenon10 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 phenomenon10)
   goals met: 2 of 7
9. (take_image satellite4 phenomenon10 instrument9 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 3 of 7
10. (turn_to satellite0 phenomenon8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 7
11. (turn_to satellite4 planet6 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 planet6)
   goals met: 4 of 7
12. (take_image satellite4 planet6 instrument9 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 5 of 7
13. (turn_to satellite4 planet7 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet7)
   goals met: 5 of 7
14. (take_image satellite4 planet7 instrument9 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 6 of 7
15. (turn_to satellite4 planet9 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 planet9)
   goals met: 6 of 7
16. (take_image satellite4 planet9 instrument9 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 7 of 7
